#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
module.webprofile_apim_api_itn.data.azurerm_key_vault.key_vault_common: Still reading... [10s elapsed]
module.function_lollipop_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_lv_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_profile_async_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_monitor_scheduled_query_rules_alert_v2.alert_service_preferences_migration_failed will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "alert_service_preferences_migration_failed" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "Some service preferences migration did not complete successfully"
      + enabled                                = true
      + evaluation_frequency                   = "P1D"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "italynorth"
      + name                                   = "[AUTH | io-p-itn-auth-profas-func-02] A service preferences migration failed"
      + resource_group_name                    = "io-p-itn-auth-main-rg-01"
      + scopes                                 = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGateways/io-p-appgateway",
        ]
      + severity                               = 1
      + tags                                   = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Auth&Identity"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
      + window_duration                        = "P1D"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-common-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-auth-error-ag-01",
            ]
        }

      + criteria {
          + operator                = "GreaterThanOrEqual"
          + query                   = <<-EOT
                customEvents
                | where name == "api.profile.migrate-legacy-preferences"
                | extend userId_ = tostring(customDimensions.userId)
                | extend action_ = tostring(customDimensions.action)
                | summarize make_set(action_, 500) by userId_
                | where set_action_ contains "REQUESTING" and not(set_action_ contains "DONE")
            EOT
          + threshold               = 1
          + time_aggregation_method = "Count"

          + failing_periods {
              + minimum_failing_periods_to_trigger_alert = 1
              + number_of_evaluation_periods             = 1
            }
        }
    }

  # module.function_lv.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lv-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-lv-func-02"
        name                                           = "io-p-itn-auth-lv-func-02"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Auth&Identity"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (32 unchanged attributes hidden)

      ~ sticky_settings {
          ~ app_setting_names       = [
              - "APPINSIGHTS_SAMPLING_PERCENTAGE",
              - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage",
              - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage",
              - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__minSamplingPercentage",
                "SLOT_TASK_HUBNAME",
                "AzureFunctionsJobHost__extensions__durableTask__hubName",
              + "APPINSIGHTS_SAMPLING_PERCENTAGE",
                "AzureFunctionsWebHost__hostid",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__minSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage",
            ]
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Warning: Deprecated Resource

  with data.azurerm_app_service.app_backend_li,
  on data.tf line 24, in data "azurerm_app_service" "app_backend_li":
  24: data "azurerm_app_service" "app_backend_li" {

The `azurerm_app_service` data source has been superseded by the
`azurerm_linux_function_app` and `azurerm_windows_web_app` data sources.
Whilst this resource will continue to be available in the 2.x and 3.x
releases it is feature-frozen for compatibility purposes, will no longer
receive any updates and will be removed in a future major release of the
Azure Provider.

(and 5 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
